docs/Descartes/TP/AutomatesCellulairesC/Notes.org
#+INCLUDE: /home/vlad/Saves/Sync/Pro/Pedagogique/CPGE/MP2I/Cours/Config/SETUP_COURS.org
#+Title: TP1: Tableaux statiques et automates cellulaires
#+Author: Vladislav Tempez - MP2I - Lycée Descartes
* TODO _ :noexport:
CLOSED: [2022-09-08 jeu. 18:34]
** DONE Fixer les noms de fonction tout du long
CLOSED: [2022-09-14 mer. 12:57]
Sauf le bonus
** DONE Écrire la correction
CLOSED: [2022-09-14 mer. 12:57]
** DONE Écrire un afficheur correct
CLOSED: [2022-09-14 mer. 15:20]
https://en.wikipedia.org/wiki/Netpbm#File_formats
Attention max 70 symboles par ligne.
** Écrire un paragraphe pour l'usage de la fonction externe
** DONE Consignes préalables
CLOSED: [2022-09-14 mer. 16:52]
+ Nommage en anglais
+ Indentation
+ Compilation avec les options
* Idées                                                            :noexport:
+ Automates cellulaires 1D
+ Utilisation de tableaux statiques de taille fixée
+ Duplication et application simultanée de règles
+ Application de la règle pour un nombre donné d'étapes
+ Détection de terminaisons ? (comment gérer les cycles ? -> lièvre et tortue un peu ambitieux)
+ Objectifs:
  + afficher des jolis motifs d'automates
  + tester des entrées pour une sortie attendue
  + encoder une règle par un entier
  + décoder une règle
* Plan                                                             :noexport:
** TODO Inclusion de fichier externes
+ Sans header (ou avec ?)
+ Comment linker ?
** TODO Syntaxe des tableaux
*** TODO Motivation pour l'usage des tableaux
+ Variables similaires
+ Traitement uniformisé
+ Boucle sur des variables
+ À terme -> création de variables de manière dynamique -> mais pas ici: ici tableau = taille fixé __à la compilation__
*** Syntaxe
+ Un tableau = un type
+ Taille déclarée à la compilation (!)
+ Possible de le remplir manuellement
+ Pas de retour possible -> passage par référence
+ Attention à la scope de déclaration
*** TODO Tableaux statiques
**** TODO Initialisation d'un tableau d'entiers
+ Dans la fonction main, déclarez un tableau et initialisez-le de manière à ce que la case i contienne i (à l'aide d'un for).
+ Écrivez une fonction qui initialise un tableau de manière à ce que la case i contienne f(i) (à l'aide d'un or) où f: i-> (non monotone non trivial, mais pas trop dur à coder).
+ Écrivez une fonction qui renvoie la somme des éléments d'un tableau, la tester sur les deux tableaux précédents
+ Écrivez une fonction qui renvoie le minimum des éléments d'un tableau, la tester sur les deux tableaux précédents
+ Écrivez une fonction qui renvoie le maximum des éléments d'un tableau, la tester sur les deux tableaux précédents
**** TODO Initialisation d'un tableau de \verb|double|
+ Reprenez les questions précédentes avec des \verb|double|
** DONE Affichage de tableaux
CLOSED: [2022-09-08 jeu. 18:13]
*** DONE Fonction dédiée avec taille en entrée
CLOSED: [2022-09-12 lun. 20:39]
+ Écrivez une fonction qui affiche un tableau d'entiers passé en argument.
*** DONE Fonction fournie qui crée un dessin/fichier texte avec l'application de l'automate
CLOSED: [2022-09-08 jeu. 18:13]
+ Disponible, après qu'ils aient fait la fonction d'affichage
** Automates cellulaires
*** TODO Définition d'une grille
+ Tableau de taille fixée contenant un nombre
+ Contenant = état de la cellule
+ Règle: l'état d'une cellule évolue en fonction de l'état de ses voisines (au sens large y compris elle-même).
+ Avec des lettres (lettres majoritaire et sinon ordre alphabétique)
+ Exemple de déroulé
*** TODO Un exemple de règle
On se place dans le cas où les nombres sont 0 ou 1 (automate binaire).
+ 18 (sierpinski)
+ Exemple de déroulement
*** DONE Règles aux bord
CLOSED: [2022-09-08 jeu. 18:20]
+ Que faire sur les bords ?
+ Bords de valeur fixée
+ Bonus: utiliser le modulo -> tore
*** DONE Application d'une étape de la règle
CLOSED: [2022-09-08 jeu. 18:20]
+ Écrire la fonction qui prend en entrée les valeurs des 3 cases et donne la sortie
+ Écrire la fonction qui renvoie le nouvel état d'un tableau à partir d'un tableau passé en paramètre (avec un nouveau tableau)
+ Bonus -> en place ? (bof parce que pointeur)
*** Application d'un nombre fini d'étapes de la règle
+ Appliquer for
+ Quand-faut-il s'arrêter ? (question ouverte)
+ Bonus: Comment détecter quand on cycle ?
*** DONE Autres exemples de règles (jolis dessins)
+ Coder d'autre règles
+ 73 (triangles de tailles #)
+ Bonus: la 110 ?
** Encodage de règle
*** Comment définir une règle
Par l'image de ses différentes entrées -> si on a un ordre sur ces entrées on peut transformer cette image en nombre
*** Convertir un tableau en int
+ Écrire une fonction qui calcule l'entier correspondant aux bits d'un tableau
*** Décodage
+ Écrire la fonction réciproque (version récursive /2 de la décomposition)
*** Fonction d'application de la règle à partir d'un entier
+ Écrire une fonction qui calcule une règle dont le numéro est passé en argument.
  + transformer le contexte en entier k, récupérer le k-ième bit de l'entier de la règle renvoyer cette valeur
+ Écrire une fonction qui met à jour un tableau à l'aide d'un entier qui spécifie la règle.
** Rendu
Points d'étapes:
+ Execution d'une règle fixée sous forme d'un fichier c
+ Execution de toutes les règles sous forme d'un fichier c
+ Non -> Trop tôt, pas prêts.

* Consignes préalables
Pour ce TP et pour le reste de l'année, il vous est demandé d'utiliser des noms de variables et de fonctions qui sont pertinents et suffisamment explicites. Le choix d'un nom pour une fonction ou une variable n'est pas une chose aisée, et dépend fortement du contexte.
Il est ainsi tout à fait acceptable de nommer une variable de boucle ~i~, alors que nommer une fonction ainsi est bien plus problématique.
Par cohérence avec les mots clé du langage et pour s'habituer à une bonne pratique il vous suggéré de nommer les variables et fonction en anglais, et de choisir comme convention séparer les mots dans un nom de variable par des ~_~ .
Les noms de fonction et de variables proposés dans ce TP et dans le code source proposé comme correction vont dans ce sens.\\

Par ailleurs, si en ~C~ la structure du code n'a aucun impact à la compilation, pour des raisons de lisibilité pour vous-même et vos éventuels correcteurs, il vous est demandé de faire apparaître la structure du code via des espaces, des sauts de ligne, etc, c'est-à-dire d'indenter celui-ci. Essayer d'utiliser les mêmes conventions dans l'ensemble de vos codes sources.\\

L'usage des options de compilation n'est pas à voir comme une contrainte dans l'écriture de vos programmes mais comme une aide à l'écriture de programme corrects. Les messages d'erreurs et d'avertissement (warnings) sont des outils important pour prévenir et corriger des bugs. *Il ne faut pas ignorer ces messages d'erreurs ni les avertissements.*
Il est donc attendu de vous que vous compiliez vos programmes avec les options:
1. ~-Wall~
2. ~-Wextra~ qui ajoutent toutes deux des avertissements concernant des morceaux de code qui contiennent probablement une erreur
3. ~-o <nom de l’exécutable>~ qui permet de nommer l'exécutable produit
4. ~-fsanitize=address,undefined~ qui permet d'obtenir des messages d'erreurs plus complets lors d'une erreur d'exécution.


* Tableaux en C
** Pourquoi utiliser des tableaux
Il est parfois intéressant d'effectuer un traitement algorithmique identique sur un nombre important de variables. Afin d'automatiser ce traitement, il est nécessaire de pouvoir accéder à ces variables de manière automatique, par exemple via une boucle. Des variables déclarées de manière individuelle ne permettent pas ceci.

L'usage de tableau permet d'obtenir une collection de variables indexées par un entier auxquelles il est possible d'accéder et de traiter via une boucle.
Dans ce TP, nous allons manipuler des tableaux dont la taille est *statique*, c'est-à-dire *fixée au moment de la compilation*, par opposition à des tableaux dynamiques dont la taille est fixée à l'exécution.

Nous verrons plus tard dans l'année comment manipuler des tableaux dont la taille est dynamique.
