docs/Descartes/TP/AutomatesCellulairesC/Notes.tex
% Created 2022-09-16 ven. 13:40
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{minted}
\usepackage[french]{babel}
\usepackage{tikz}
\usepackage{minted}
\usepackage[margin=1in,footskip=0.2in]{geometry}
\author{Vladislav Tempez - MP2I - Lycée Descartes}
\date{\today}
\title{TP1: Tableaux statiques et automates cellulaires}
\hypersetup{
 pdfauthor={Vladislav Tempez - MP2I - Lycée Descartes},
 pdftitle={TP1: Tableaux statiques et automates cellulaires},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 28.1 (Org mode 9.5.2)}, 
 pdflang={French}}
\begin{document}

\maketitle

\section{Consignes préalables}
\label{sec:org5677c8f}
Pour ce TP et pour le reste de l'année, il vous est demandé d'utiliser des noms de variables et de fonctions qui sont pertinents et suffisamment explicites. Le choix d'un nom pour une fonction ou une variable n'est pas une chose aisée, et dépend fortement du contexte.
Il est ainsi tout à fait acceptable de nommer une variable de boucle \texttt{i}, alors que nommer une fonction ainsi est bien plus problématique.
Par cohérence avec les mots clé du langage et pour s'habituer à une bonne pratique il vous suggéré de nommer les variables et fonction en anglais, et de choisir comme convention séparer les mots dans un nom de variable par des \texttt{\_} .
Les noms de fonction et de variables proposés dans ce TP et dans le code source proposé comme correction vont dans ce sens.\\

Par ailleurs, si en \texttt{C} la structure du code n'a aucun impact à la compilation, pour des raisons de lisibilité pour vous-même et vos éventuels correcteurs, il vous est demandé de faire apparaître la structure du code via des espaces, des sauts de ligne, etc, c'est-à-dire d'indenter celui-ci. Essayer d'utiliser les mêmes conventions dans l'ensemble de vos codes sources.\\

L'usage des options de compilation n'est pas à voir comme une contrainte dans l'écriture de vos programmes mais comme une aide à l'écriture de programme corrects. Les messages d'erreurs et d'avertissement (warnings) sont des outils important pour prévenir et corriger des bugs. \textbf{Il ne faut pas ignorer ces messages d'erreurs ni les avertissements.}
Il est donc attendu de vous que vous compiliez vos programmes avec les options:
\begin{enumerate}
\item \texttt{-Wall}
\item \texttt{-Wextra} qui ajoutent toutes deux des avertissements concernant des morceaux de code qui contiennent probablement une erreur
\item \texttt{-o <nom de l’exécutable>} qui permet de nommer l'exécutable produit
\item \texttt{-fsanitize=address,undefined} qui permet d'obtenir des messages d'erreurs plus complets lors d'une erreur d'exécution.
\end{enumerate}


\section{Tableaux en C}
\label{sec:org82aef3c}
\subsection{Pourquoi utiliser des tableaux}
\label{sec:org139c1d7}
Il est parfois intéressant d'effectuer un traitement algorithmique identique sur un nombre important de variables. Afin d'automatiser ce traitement, il est nécessaire de pouvoir accéder à ces variables de manière automatique, par exemple via une boucle. Des variables déclarées de manière individuelle ne permettent pas ceci.

L'usage de tableau permet d'obtenir une collection de variables indexées par un entier auxquelles il est possible d'accéder et de traiter via une boucle.
Dans ce TP, nous allons manipuler des tableaux dont la taille est \textbf{statique}, c'est-à-dire \textbf{fixée au moment de la compilation}, par opposition à des tableaux dynamiques dont la taille est fixée à l'exécution.

Nous verrons plus tard dans l'année comment manipuler des tableaux dont la taille est dynamique.
