docs/Descartes/TP/AutomatesCellulairesC/Notes.org
** Syntaxe des tableaux statiques en C
En C les tableaux sont fortement typés, comme le sont les variables. Cela signifie qu'ils ne peuvent contenir qu'un seul type de valeur.
La déclaration d'un tableau se fait avec la syntaxe suivante:
#+begin_src C
  <type> <nom_du_tableau>[<taille_du_tableau>];
#+end_src
Attention, la taille du tableau doit sous la forme d'une expression qui ne contient pas de variable, ~3*5~ convient, mais pas ~2*n~, même si ~n~ est une variable déjà déclarée et définie dont la valeur ne change pas.

Un exemple de déclaration de tableau où on déclare un tableau de 5 ~double~ nommé ~some_double_array~:
#+begin_src C
  double some_double_array[5*5];
#+end_src

L'initialisation des valeurs d'un tableau peut être faite de deux manière. La première manière ne peut être réalisée que lors de la déclaration du tableau et consiste à fournir les éléments dans l'ordre, séparés par des virgules:
#+begin_src C
  int some_int_array[3] = {1, 2, 3};
#+end_src
ou bien
#+begin_src C
  double some_double_array[5*5] = { 0 };
#+end_src
pour initialiser tous les éléments à 0.\\

Pour accéder aux éléments d'un tableau on peut utiliser la syntaxe
#+begin_src C
  <nom_du_tableau>[<indice>]
#+end_src
par exemple on accède au 3e élément du tableau ~some_int_array~ avec la syntaxe:
#+begin_src C
  some_int_array[2]
#+end_src
Ici, le troisième élément est indicé par 2 car les indices comment à 0.\\

On peut respectivement récupérer cette valeur dans une variable ou la modifier:
#+begin_src C
  int a = some_int_array[2];
  some_int_array[2] = 2*a;
#+end_src

Les tableaux se comportent différemment des variables classiques: il n'est pas possible de le renvoyer en tant que valeur, mais les modifications appliquées lors de l'exécution d'une fonction persistent à la sortie de la fonction.\\

On peut illustrer ceci avec un exemple
#+begin_src C :export both :results pp
  #include <stdio.h>

  void incr(int x){
    x = x+1;
  }

  void incr_array(int array[], int array_size){
    if (0 <taille_t){
      t[0] = t[0]+1;
    }
  }
  int main(){
    int x = 0;
    int t[3] = { 0 };
    printf("x before incr %d\n",x);
    incr(x);
    printf("x after incr %d\n",x);
    printf("a_0 before incr %d\n",t[0]);
    incr_tab(t);
    printf("a_0 after incr %d\n",t[0]);
  }
#+end_src

qui donne:

: x avant 0
: x après 0
: t_0 avant 0
: t_0 après 1

On dit que ~x~ est passé par *valeur* alors que ~t~ est passé par *paramètre*. Le détail de ce mécanisme sera expliqué quand nous aborderons les pointeurs. Une conséquence de ceci (dont l'explication précise n'est pas donnée ici) est qu'on ne peut pas utiliser un tableau déclaré dans une fonction une fois sorti de la fonction. En particulier, *une fonction ne peut pas renvoyer de tableau* pour le moment.

On peut noter que pour déclarer que l'argument d'une fonction est de type ~int~ on indique ~int <nom_du_tableau>[]~ dans les arguments de la fonction. Il n'est pas nécessaire d'indiquer entre [] la taille du tableau.

Cependant, il n'est pas directement possible de connaître la taille du tableau à partir de celui-ci. Il est donc *impératif de passer en argument de toute fonction qui manipule un tableau la taille de ce tableau*.

** Quelques exercices de syntaxe sur les tableaux
1. Dans la fonction main, déclarez un tableau d'entier de taille 10 et initialisez-le de manière à ce que la case ~i~ contienne ~i~ (à l'aide d'un ~for~).
2. Écrivez une fonction ~void print_int_array(int t[], int array_size)~ qui affiche les éléments d'un tableau d'entier sur une même ligne et un retour à la ligne en fin de tableau.
3. Écrivez une fonction ~void init_array(int array[], int array_size)~ qui initialise un tableau de manière à ce que la case ~i~ contienne ~f(i)~ (à l'aide d'un ~for~) où ~int f(int i)~ renvoie la plus grande puissance de 2 inférieure à ~i~, c'est-à-dire ~k~ tel que \(2^k \leq i \leq 2^{k+1}\) ou bien 0 si ~k~ est une puissance de 2.
4. Écrivez une fonction ~int int_array_sum(int array[], int array_size)~ qui renvoie la somme des éléments d'un tableau, la tester sur les deux tableaux précédents
5. Écrivez une fonction ~int int_array_min(int array[], int array_size)~ qui renvoie le minimum des éléments d'un tableau, la tester sur les deux tableaux
6. Écrivez une fonction ~int int_array_max(int array[], int array_size)~ qui renvoie le maximum des éléments d'un tableau, la tester sur les deux tableaux précédents
7. Reprenez ces questions pour des tableaux contenant des ~double~.
** Présentation des automates cellulaires
Dans le reste de ce TP on va s'intéresser à certains automates cellulaires. Les automates cellulaires sont des sortes de machines, dont l'instance la plus célèbre est le *Jeu de la vie* inventé par /John Conway/.

Plus formellement, un automate cellulaire est constitué d'une *grille* dont les *cases* (ou *cellules*) peuvent être dans un nombre fini d'états. L'état dans lequel sont ces cases évolue en fonction de l'état courant et de l'état des cases voisines.
L'ensemble des états de la grille à une étape donnée est appelé une *configuration*.
La plupart du temps la grille est un quadrillage de dimension finie ou infinie et les cases voisines sont les cases qui bordent une case donnée.

Ici nous nous intéresserons à des automates cellulaires plus modeste pour lesquels la grille est en une dimension et d'une taille finie. On représentera bien entendu ces grilles par des tableaux.
On peut illustrer ceci avec l'exemple d'automate cellulaire suivant:
+ La grille est un tableau de 5 cases adjacentes, numérotées de 0 à 4;
+ Chaque case de la grille peut être dans un des états suivants: {a, b, c, d}.
+ Les cases voisine d'une case donnée sont les cases situées à sa droite et à sa gauche.
+ L'état d'une case évolue de manière à prendre l'état majoritaire parmi les cases voisine, case courante comprise. C'est l'ordre alphabétique qui départage les égalités.

On peut voir ici un exemple d'évolution des états d'un tel automate à partir d'un état initial:
#+attr_latex: :align |c|c|c|c|c|c|
|---+--------+--------+--------+--------+--------|
| t | case 0 | case 1 | case 2 | case 3 | case 4 |
|---+--------+--------+--------+--------+--------|
| 0 | b      | a      | b      | c      | c      |
| 1 | a      | b      | a      | c      | c      |
| 2 | a      | a      | a      | c      | c      |
| 3 | a      | a      | a      | c      | c      |
|---+--------+--------+--------+--------+--------|

Pour les cases du bord, on a utilisé le seul voisin disponible dans le décompte de l'état majoritaire.

