docs/Descartes/TP/AutomatesCellulairesC/Notes.tex
\subsection{Syntaxe des tableaux statiques en C}
\label{sec:org90e42a2}
En C les tableaux sont fortement typés, comme le sont les variables. Cela signifie qu'ils ne peuvent contenir qu'un seul type de valeur.
La déclaration d'un tableau se fait avec la syntaxe suivante:
\begin{minted}[]{c}
<type> <nom_du_tableau>[<taille_du_tableau>];
\end{minted}
Attention, la taille du tableau doit sous la forme d'une expression qui ne contient pas de variable, \texttt{3*5} convient, mais pas \texttt{2*n}, même si \texttt{n} est une variable déjà déclarée et définie dont la valeur ne change pas.

Un exemple de déclaration de tableau où on déclare un tableau de 25 = 5x5 \texttt{double} nommé \texttt{some\_double\_array}:
\begin{minted}[]{c}
double some_double_array[5*5];
\end{minted}

L'initialisation des valeurs d'un tableau peut être faite de deux manière. La première manière ne peut être réalisée que lors de la déclaration du tableau et consiste à fournir les éléments dans l'ordre, séparés par des virgules:
\begin{minted}[]{c}
int some_int_array[3] = {1, 2, 3};
\end{minted}
ou bien
\begin{minted}[]{c}
double some_double_array[5*5] = { 0 };
\end{minted}
pour initialiser tous les éléments à 0.\\

Pour accéder aux éléments d'un tableau on peut utiliser la syntaxe
\begin{minted}[]{c}
<nom_du_tableau>[<indice>]
\end{minted}
par exemple on accède au 3e élément du tableau \texttt{some\_int\_array} avec la syntaxe:
\begin{minted}[]{c}
some_int_array[2]
\end{minted}
Ici, le troisième élément est indicé par 2 car les indices comment à 0.\\

On peut respectivement récupérer cette valeur dans une variable ou la modifier:
\begin{minted}[]{c}
int a = some_int_array[2];
some_int_array[2] = 2*a;
\end{minted}

Les tableaux se comportent différemment des variables classiques: il n'est pas possible de le renvoyer en tant que valeur, mais les modifications appliquées lors de l'exécution d'une fonction persistent à la sortie de la fonction.\\

On peut illustrer ceci avec un exemple
\begin{minted}[]{c}
#include <stdio.h>

void incr(int x){
  x = x+1;
}

void incr_array(int array[], int array_size){
  if (0 < array_size){
    array[0] = array[0]+1;
  }
}
int main(){
  int x = 0;
  int array[3] = { 0 };
  printf("x before incr %d\n", x);
  incr(x);
  printf("x after incr %d\n", x);
  printf("a_0 before incr %d\n", array[0]);
  incr_array(array, 3);
  printf("a_0 after incr %d\n", array[0]);
}
\end{minted}

qui donne:
\begin{verbatim}
x before incr 0
x after incr 0
a_0 before incr 0
a_0 after incr 1
\end{verbatim}


On dit que \texttt{x} est passé par \textbf{valeur} alors que \texttt{t} est passé par \textbf{paramètre}. Le détail de ce mécanisme sera expliqué quand nous aborderons les pointeurs. Une conséquence de ceci (dont l'explication précise n'est pas donnée ici) est qu'on ne peut pas utiliser un tableau déclaré dans une fonction une fois sorti de la fonction. En particulier, \textbf{une fonction ne peut pas renvoyer de tableau} pour le moment.

On peut noter que pour déclarer que l'argument d'une fonction est de type \texttt{int} on indique \texttt{int <nom\_du\_tableau>[]} dans les arguments de la fonction. Il n'est pas nécessaire d'indiquer entre [] la taille du tableau.

Cependant, il n'est pas directement possible de connaître la taille du tableau à partir de celui-ci. Il est donc \textbf{impératif de passer en argument de toute fonction qui manipule un tableau la taille de ce tableau}.

\subsection{Quelques exercices de syntaxe sur les tableaux}
\label{sec:org9f8f857}
\begin{enumerate}
\item Dans la fonction main, déclarez un tableau d'entier de taille 10 et initialisez-le de manière à ce que la case \texttt{i} contienne \texttt{i} (à l'aide d'un \texttt{for}).
\item Écrivez une fonction \texttt{void print\_int\_array(int t[], int array\_size)} qui affiche les éléments d'un tableau d'entier sur une même ligne et un retour à la ligne en fin de tableau.
\item Écrivez une fonction \texttt{void init\_array(int array[], int array\_size)} qui initialise un tableau de manière à ce que la case \texttt{i} contienne \texttt{f(i)} (à l'aide d'un \texttt{for}) où \texttt{int f(int i)} renvoie la plus grande puissance de 2 inférieure à \texttt{i}, c'est-à-dire \texttt{k} tel que \(2^k \leq i \leq 2^{k+1}\) ou bien 0 si \texttt{k} est une puissance de 2.
\item Écrivez une fonction \texttt{int int\_array\_sum(int array[], int array\_size)} qui renvoie la somme des éléments d'un tableau, la tester sur les deux tableaux précédents
\item Écrivez une fonction \texttt{int int\_array\_min(int array[], int array\_size)} qui renvoie le minimum des éléments d'un tableau, la tester sur les deux tableaux
\item Écrivez une fonction \texttt{int int\_array\_max(int array[], int array\_size)} qui renvoie le maximum des éléments d'un tableau, la tester sur les deux tableaux précédents
\item Reprenez ces questions pour des tableaux contenant des \texttt{double}.
\end{enumerate}
\subsection{Présentation des automates cellulaires}
\label{sec:orgda2c638}
Dans le reste de ce TP on va s'intéresser à certains automates cellulaires. Les automates cellulaires sont des sortes de machines, dont l'instance la plus célèbre est le \textbf{Jeu de la vie} inventé par \emph{John Conway}.

Plus formellement, un automate cellulaire est constitué d'une \textbf{grille} dont les \textbf{cases} (ou \textbf{cellules}) peuvent être dans un nombre fini d'états. L'état dans lequel sont ces cases évolue en fonction de l'état courant et de l'état des cases voisines.
L'ensemble des états de la grille à une étape donnée est appelé une \textbf{configuration}.
La plupart du temps la grille est un quadrillage de dimension finie ou infinie et les cases voisines sont les cases qui bordent une case donnée.

Ici nous nous intéresserons à des automates cellulaires plus modeste pour lesquels la grille est en une dimension et d'une taille finie. On représentera bien entendu ces grilles par des tableaux.
On peut illustrer ceci avec l'exemple d'automate cellulaire suivant:
\begin{itemize}
\item La grille est un tableau de 5 cases adjacentes, numérotées de 0 à 4;
\item Chaque case de la grille peut être dans un des états suivants: \{a, b, c, d\}.
\item Les cases voisine d'une case donnée sont les cases situées à sa droite et à sa gauche.
\item L'état d'une case évolue de manière à prendre l'état majoritaire parmi les cases voisine, case courante comprise. C'est l'ordre alphabétique qui départage les égalités.
\end{itemize}

On peut voir ici un exemple d'évolution des états d'un tel automate à partir d'un état initial:
\begin{center}
\begin{tabular}{|c|c|c|c|c|c|}
\hline
t & case 0 & case 1 & case 2 & case 3 & case 4\\
\hline
0 & b & a & b & c & c\\
1 & a & b & a & c & c\\
2 & a & a & a & c & c\\
3 & a & a & a & c & c\\
\hline
\end{tabular}
\end{center}

Pour les cases du bord, on a utilisé le seul voisin disponible dans le décompte de l'état majoritaire.
