docs/Descartes/TP/AutomatesCellulairesC/Notes.org
** Implémentation d'un premier automate cellulaire
Pour implémenter un premier automate cellulaire, nous allons nous fixer des règles et états plus simple encore:
+ La grille est un tableau de 64 cases.
+ Chaque case peut prendre l'état 0 ou 1.
+ L'évolution des états est donnée par le tableau suivant:
#+attr_latex: :align |c|c|c|c|
|-------------------+---------------+-------------------+-------------|
| voisine de gauche | case courante | voisine de droite | nouvel état |
|-------------------+---------------+-------------------+-------------|
|                 0 |             0 |                 0 |           0 |
|                 0 |             0 |                 1 |           1 |
|                 0 |             1 |                 0 |           0 |
|                 0 |             1 |                 1 |           0 |
|                 1 |             0 |                 0 |           1 |
|                 1 |             0 |                 1 |           0 |
|                 1 |             1 |                 0 |           0 |
|                 1 |             1 |                 1 |           0 |
|-------------------+---------------+-------------------+-------------|

Ou plus graphiquement, avec en noire les états 1 et en blanc les états 0.

#+attr_latex: :align |c|c|c|c|c|c|c|c|c|
|-----------------------------------+-----------------------+----------------------------+----------------------------+---------------------------------+----------------------------+---------------------------------+---------------------------------+--------------------------------------|
| état courant (voisines comprises) | \square\square\square | \square\square\blacksquare | \square\blacksquare\square | \square\blacksquare\blacksquare | \blacksquare\square\square | \blacksquare\square\blacksquare | \blacksquare\blacksquare\square | \blacksquare\blacksquare\blacksquare |
|-----------------------------------+-----------------------+----------------------------+----------------------------+---------------------------------+----------------------------+---------------------------------+---------------------------------+--------------------------------------|
| nouvel état de la case courante   | \square               | \blacksquare               |                   \square         |                             \square    |  \blacksquare                          |                        \square         |                   \square             |                      \square               |
|-----------------------------------+-----------------------+----------------------------+----------------------------+---------------------------------+----------------------------+---------------------------------+---------------------------------+--------------------------------------|

1. Déroulez sur un papier 3 étapes de l'évolution de cet automate sur un papier pour une grille réduite à 5 cases. Quel problème se pose ? Comment proposeriez-vous de le régler ?
2. Dans la suite de ce TP, on fixera les états des cases voisines à gauche de 0 et à droite de la case la plus à droite (63) comme constants à 0.
3. (Bonus) Imaginez une autre manière de procéder que de fixer un état pour les cases adjacentes au bord. Pendant ce TP implémentez ce qui est nécessaire pour procéder de cette manière.
4. Écrivez une fonction ~int automata_rule(int current_cell, int left_cell, int right_cell)~ qui prend en entrée l'état d'une case et de ses deux voisines et renvoie la sortie selon la règle détaillée plus haut.
5. Écrivez une fonction ~void update_state(int grid_now[], int updated_grid[], int grid_size)~ qui calcule et stocke un nouvel état de grille dans le tableau ~updated_grid~ passé en argument à partir d'un état courant contenu dans ~grid_now~. Cette fonction sera capable de calculer un nouvel état pour une taille de grille arbitraire mais passée en argument sous le nom ~grid_size~.
6. (Bonus) Écrivez une fonction qui met à jour l'état d'une grille *en place*, c'est-à-dire sans avoir besoin d'un tableau supplémentaire pour stocker le nouvel état en modifiant directement le tableau contenant l'état courant. Attention à bien vérifier que cette fonction a un comportement identique à la fonction précédente.
7. Écrivez une fonction ~void run_automata(int init_grid[], int previous_step_grid[], int next_step_grid[], int grid_size, int nb_steps)~ qui affiche dans le terminal les états successifs de l'automate à partir d'une grille initiale ~init_grid~ de taille ~grid_size~ pendant ~nb_steps~ étapes en se servant des tableaux ~previous_step_grid~ et ~next_step_grid~ pour stocker les résultats du calcul d'un changement d'état.
8. Essayez cette fonction sur une grille initiale de taille 64 dont toutes les cases sont dans l'état 0 sauf la 31e pour un nombre d'étapes de votre choix.
9. Pour obtenir un meilleur affichage, écrivez une fonction ~void print_grid_state(int grid[], int grid_size)~ qui affiche des ~*~ pour les cases dans l'état ~1~ et des espaces pour les cases dans l'état ~0~.
10. Appliquez cette fonction à partir d'autres états initiaux plus diversifiés, qu'observez-vous ?
** Un affichage encore amélioré
Le terminal ne permet pas d'afficher correctement des grilles dont la taille est supérieure à 80 cases. Pour résoudre ce problème nous allons créer une image dans le format basique ~.pbm~ pour /portable bitmap/.
Un fichier ~StatePrint.c~ est fourni pour ce TP dans le répertoire partagé.
Ce fichier contient les fonctions
1. ~FILE* init_picture(char *name, int grid_size, int nb_steps)~ qui permet de créer un fichier image aux dimensions de la grille et du nombre d'étapes à afficher et renvoie ce fichier. L'argument ~name~ correspond au nom du fichier et devra terminer par ~.pbm~. Ce fichier sera créé à l'endroit où est exécuté le programme C. Le type de ce fichier est ~FILE*~. Nous n'aborderons pas dans le TP l'écriture et la lecture de fichiers en C.
2. ~print_state_to_file(FILE *f, int grid_state[], int grid_size)~ qui permet d'écrire dans le fichier image les informations nécessaires à l'affichage de l'état de la grille contenu dans ~grid_state~.
3. ~void save_picture(FILE *f)~ qui permet de réaliser les opérations nécessaires à la sauvegarde du fichier.
Pour intégrer utiliser le code d'un fichier externe, vous pouvez ajouter la ligne ~#include "<nom_du_fichier>.c"~ en haut de votre code source si ce fichier est placé dans le même répertoire que le code source dans lequel il est inclus.
4. Écrivez une fonction ~run_automata_with_picture(int init_grid[], int previous_step_grid[], int next_step_grid[], int grid_size, int nb_steps)~ qui crée une image des états successifs de l'automate plutôt que de les afficher dans le terminal.
5. Générez une image pour une grille de taille 256 et 1000 états successifs.
** Pour aller plus loin (Bonus)
+ Remplacez la règle décrite précédemment par la règle suivante et observez les motifs obtenus:
#+attr_latex: :align |c|c|c|c|c|c|c|c|c|
|-----------------------------------+-----------------------+----------------------------+----------------------------+---------------------------------+----------------------------+---------------------------------+---------------------------------+--------------------------------------|
| état courant (voisines comprises) | \square\square\square | \square\square\blacksquare | \square\blacksquare\square | \square\blacksquare\blacksquare | \blacksquare\square\square | \blacksquare\square\blacksquare | \blacksquare\blacksquare\square | \blacksquare\blacksquare\blacksquare |
|-----------------------------------+-----------------------+----------------------------+----------------------------+---------------------------------+----------------------------+---------------------------------+---------------------------------+--------------------------------------|
| nouvel état de la case courante   | \blacksquare          | \square                    |                   \square         |                             \blacksquare |  \square                               |                        \square         |                   \blacksquare    |                      \square               |
|-----------------------------------+-----------------------+----------------------------+----------------------------+---------------------------------+----------------------------+---------------------------------+---------------------------------+--------------------------------------|
+ À partir de combien d'étape a-t-on vu tout ce qu'il y avait à voir pour un état initial donné ? Comment pourrait-on détecter cet état de fait ou calculer ce nombre d'étapes ?
