docs/Descartes/TP/AutomatesCellulairesC/Notes.tex

\subsection{Implémentation d'un premier automate cellulaire}
\label{sec:org0958e7a}
Pour implémenter un premier automate cellulaire, nous allons nous fixer des règles et états plus simple encore:
\begin{itemize}
\item La grille est un tableau de 64 cases.
\item Chaque case peut prendre l'état 0 ou 1.
\item L'évolution des états est donnée par le tableau suivant:
\end{itemize}
\begin{center}
\begin{tabular}{|c|c|c|c|}
\hline
voisine de gauche & case courante & voisine de droite & nouvel état\\
\hline
0 & 0 & 0 & 0\\
0 & 0 & 1 & 1\\
0 & 1 & 0 & 0\\
0 & 1 & 1 & 0\\
1 & 0 & 0 & 1\\
1 & 0 & 1 & 0\\
1 & 1 & 0 & 0\\
1 & 1 & 1 & 0\\
\hline
\end{tabular}
\end{center}

Ou plus graphiquement, avec en noire les états 1 et en blanc les états 0.

\begin{center}
\begin{tabular}{|c|c|c|c|c|c|c|c|c|}
\hline
état courant (voisines comprises) & \square\square\square & \square\square\blacksquare & \square\blacksquare\square & \square\blacksquare\blacksquare & \blacksquare\square\square & \blacksquare\square\blacksquare & \blacksquare\blacksquare\square & \blacksquare\blacksquare\blacksquare\\
\hline
nouvel état de la case courante & \square & \blacksquare & \square & \square & \blacksquare & \square & \square & \square\\
\hline
\end{tabular}
\end{center}

\begin{enumerate}
\item Déroulez sur un papier 3 étapes de l'évolution de cet automate sur un papier pour une grille réduite à 5 cases et à partir d'un état que vous choisirez. Quel problème se pose ? Comment proposeriez-vous de le régler ?
\item Dans la suite de ce TP, on fixera les états des cases voisines à gauche de 0 et à droite de la case la plus à droite (63) comme constants à 0.
\item (Bonus) Imaginez une autre manière de procéder que de fixer un état pour les cases adjacentes au bord. Pendant ce TP implémentez ce qui est nécessaire pour procéder de cette manière.
\item Écrivez une fonction \texttt{int automata\_rule(int current\_cell, int left\_cell, int right\_cell)} qui prend en entrée l'état d'une case et de ses deux voisines et renvoie la sortie selon la règle détaillée plus haut.
\item Écrivez une fonction \texttt{void update\_state(int grid\_now[], int updated\_grid[], int grid\_size)} qui calcule et stocke un nouvel état de grille dans le tableau \texttt{updated\_grid} passé en argument à partir d'un état courant contenu dans \texttt{grid\_now}. Cette fonction sera capable de calculer un nouvel état pour une taille de grille arbitraire mais passée en argument sous le nom \texttt{grid\_size}.
\item (Bonus) Écrivez une fonction qui met à jour l'état d'une grille \textbf{en place}, c'est-à-dire sans avoir besoin d'un tableau supplémentaire pour stocker le nouvel état en modifiant directement le tableau contenant l'état courant. Attention à bien vérifier que cette fonction a un comportement identique à la fonction précédente.
\item Écrivez une fonction \texttt{void run\_automata(int init\_grid[], int previous\_step\_grid[], int next\_step\_grid[], int grid\_size, int nb\_steps)} qui affiche dans le terminal les états successifs de l'automate à partir d'une grille initiale \texttt{init\_grid} de taille \texttt{grid\_size} pendant \texttt{nb\_steps} étapes en se servant des tableaux \texttt{previous\_step\_grid} et \texttt{next\_step\_grid} pour stocker les résultats du calcul d'un changement d'état.
\item Essayez cette fonction sur une grille initiale de taille 64 dont toutes les cases sont dans l'état 0 sauf la 31e pour un nombre d'étapes de votre choix.
\item Pour obtenir un meilleur affichage, écrivez une fonction \texttt{void print\_grid\_state(int grid[], int grid\_size)} qui affiche des \texttt{*} pour les cases dans l'état \texttt{1} et des espaces pour les cases dans l'état \texttt{0}.
\item Appliquez cette fonction à partir d'autres états initiaux plus diversifiés, qu'observez-vous ?
\end{enumerate}
\subsection{Un affichage encore amélioré}
\label{sec:orgf34b47e}
Le terminal ne permet pas d'afficher correctement des grilles dont la taille est supérieure à 80 cases. Pour résoudre ce problème nous allons créer une image dans le format basique \texttt{.pbm} pour \emph{portable bitmap}.
Un fichier \texttt{StatePrint.c} est fourni pour ce TP dans le répertoire partagé.
Ce fichier contient les fonctions
\begin{enumerate}
\item \texttt{FILE* init\_picture(char *name, int grid\_size, int nb\_steps)} qui permet de créer un fichier image aux dimensions de la grille et du nombre d'étapes à afficher et renvoie ce fichier. L'argument \texttt{name} correspond au nom du fichier et devra terminer par \texttt{.pbm}. Ce fichier sera créé à l'endroit où est exécuté le programme C. Le type de ce fichier est \texttt{FILE*}. Nous n'aborderons pas dans le TP l'écriture et la lecture de fichiers en C.
\item \texttt{print\_state\_to\_file(FILE *f, int grid\_state[], int grid\_size)} qui permet d'écrire dans le fichier image les informations nécessaires à l'affichage de l'état de la grille contenu dans \texttt{grid\_state}.
\item \texttt{void save\_picture(FILE *f)} qui permet de réaliser les opérations nécessaires à la sauvegarde du fichier.
\end{enumerate}
Pour intégrer utiliser le code d'un fichier externe, vous pouvez ajouter la ligne \texttt{\#include "<nom\_du\_fichier>.c"} en haut de votre code source si ce fichier est placé dans le même répertoire que le code source dans lequel il est inclus.
\begin{enumerate}
\item Écrivez une fonction \texttt{run\_automata\_with\_picture(int init\_grid[], int previous\_step\_grid[], int next\_step\_grid[], int grid\_size, int nb\_steps)} qui crée une image des états successifs de l'automate plutôt que de les afficher dans le terminal.
\item Générez une image pour une grille de taille 256 et 1000 états successifs.
\end{enumerate}
\subsection{Pour aller plus loin (Bonus)}
\label{sec:org450bbb8}
\begin{itemize}
\item Remplacez la règle décrite précédemment par la règle suivante et observez les motifs obtenus:
\end{itemize}
\begin{center}
\begin{tabular}{|c|c|c|c|c|c|c|c|c|}
\hline
état courant (voisines comprises) & \square\square\square & \square\square\blacksquare & \square\blacksquare\square & \square\blacksquare\blacksquare & \blacksquare\square\square & \blacksquare\square\blacksquare & \blacksquare\blacksquare\square & \blacksquare\blacksquare\blacksquare\\
\hline
nouvel état de la case courante & \blacksquare & \square & \square & \blacksquare & \square & \square & \blacksquare & \square\\
\hline
\end{tabular}
\end{center}
\begin{itemize}
\item À partir de combien d'étape a-t-on vu tout ce qu'il y avait à voir pour un état initial donné ? Comment pourrait-on détecter cet état de fait ou calculer ce nombre d'étapes ?
\end{itemize}
