docs/Descartes/TP/AutomatesCellulairesC/Notes.tex
\subsection{Génération de toutes les règles d'évolution pour les automates de ce type (Bonus)}
\label{sec:org7adedb9}
On a pour le moment vu deux règles différente d'évolution de l'état des cases. Dans cette partie nous allons tenter d'énumérer toutes les règles possibles et d'implémenter une fonction qui applique une règle étant donné son numéro.

Pour énumérer ces règles, la première étape consiste à s'assurer que celles-ci sont en nombre fini.
\begin{enumerate}
\item Comment pourrait-on formaliser une règle sous la forme d'une fonction ? Précisez les ensembles de départ et d'arrivée de cette fonction.
\item Calculez combien il existe de règles différentes d'après cette formulation.
\item Pour caractériser une règle, on choisit de fixer un ordre sur les différentes configurations possible de voisinage pour une case. On peut remarquer qu'on a déjà procédé de la sorte dans la description des règles précédentes. Proposez une numérotation pour les différentes configurations possible, en n'oubliant pas que l'état de chacune des cases est un 0 ou un 1.
\item Une fois une numérotation fixée sur les différentes configurations de voisinage, comment décrire de manière minimaliste une règle à l'aide de 0 et de 1.
\item Déduisez de cette représentation une numérotation des règles.
\item Écrivez une fonction qui étant donné un tableau de 0 et de 1 calcule l'entier dont c'est la représentation en base 2. Le nombre dans la case 0 correspondra au coefficient associé à la puissance de 2 la plus petite.
\item Écrivez la fonction réciproque qui stocke dans un tableau, dont la taille est soigneusement choisie, la décomposition en base 2 d'un entier passé en entrée.
\item Écrivez une fonction qui étant donné l'état d'une case et de ses deux voisines applique la règle dont le numéro est donné comme argument supplémentaire et calcule le nouvel état de la case courante. On pourra transformer cet état du voisinage en un entier, le numéro de ce voisinage et obtenir l'image de ce voisinage à partir de la décomposition du numéro de la règle.
\item Écrivez une variante des fonctions \texttt{update\_grid} et \texttt{run} pour appliquer une règle dont le numéro est donné en argument.
\item Observez les motifs produits par plusieurs règles de votre choix.
\end{enumerate}
\end{document}